#  Write a Python program to perform the following tasks-1.Create a pandas series from the below dictionary where indices are subjects:

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
Sub = {'English':{'Sam':60,'Jackson':74,'Ahree':85}, 
      'History':{'Gloria':83,'Sam':65,'Isla':78,'Aron':72,'Gray':61},
       'Geography':{'Jackson':92,'Gloria':95,'Isla':82,'Aron':75,'Ahree':76},
       'Mathematics':{'Sam':99,'Gloria':74,'Jackson':89,'Ahree':85,'Gray':95},
      'Science':{'Sam':89,'Aron':82,'Gray':78,'Isla':93,'Ahree':87}}

In [3]:
# Converting Series into Data Frame 

Sub_series = pd.Series(Sub)
print(Sub_series)
df = pd.DataFrame(Sub)
print(df)

English                  {'Sam': 60, 'Jackson': 74, 'Ahree': 85}
History        {'Gloria': 83, 'Sam': 65, 'Isla': 78, 'Aron': ...
Geography      {'Jackson': 92, 'Gloria': 95, 'Isla': 82, 'Aro...
Mathematics    {'Sam': 99, 'Gloria': 74, 'Jackson': 89, 'Ahre...
Science        {'Sam': 89, 'Aron': 82, 'Gray': 78, 'Isla': 93...
dtype: object
         English  History  Geography  Mathematics  Science
Sam         60.0     65.0        NaN         99.0     89.0
Jackson     74.0      NaN       92.0         89.0      NaN
Ahree       85.0      NaN       76.0         85.0     87.0
Gloria       NaN     83.0       95.0         74.0      NaN
Isla         NaN     78.0       82.0          NaN     93.0
Aron         NaN     72.0       75.0          NaN     82.0
Gray         NaN     61.0        NaN         95.0     78.0

In [4]:
# Converting Null values to Zeros 

df.fillna(value = 0,
          inplace = True)
 
# Show the DataFrame
print(df)

         English  History  Geography  Mathematics  Science
Sam         60.0     65.0        0.0         99.0     89.0
Jackson     74.0      0.0       92.0         89.0      0.0
Ahree       85.0      0.0       76.0         85.0     87.0
Gloria       0.0     83.0       95.0         74.0      0.0
Isla         0.0     78.0       82.0          0.0     93.0
Aron         0.0     72.0       75.0          0.0     82.0
Gray         0.0     61.0        0.0         95.0     78.0

In [5]:
# Transposing the Data Frame 

df.transpose()

              Sam  Jackson  Ahree  Gloria  Isla  Aron  Gray
English      60.0     74.0   85.0     0.0   0.0   0.0   0.0
History      65.0      0.0    0.0    83.0  78.0  72.0  61.0
Geography     0.0     92.0   76.0    95.0  82.0  75.0   0.0
Mathematics  99.0     89.0   85.0    74.0   0.0   0.0  95.0
Science      89.0      0.0   87.0     0.0  93.0  82.0  78.0

In [6]:
# Creating new Column Average 

new = df['Average'] = df.mean(axis=1)
print(new )

Sam        62.6
Jackson    51.0
Ahree      66.6
Gloria     50.4
Isla       50.6
Aron       45.8
Gray       46.8
dtype: float64

In [7]:
# showing the Contents

df.describe()

         English    History  Geography  Mathematics    Science   Average
count   7.000000   7.000000   7.000000     7.000000   7.000000   7.00000
mean   31.285714  51.285714  60.000000    63.142857  61.285714  53.40000
std    39.685070  35.803698  41.661333    43.853653  42.141485   7.98749
min     0.000000   0.000000   0.000000     0.000000   0.000000  45.80000
25%     0.000000  30.500000  37.500000    37.000000  39.000000  48.60000
50%     0.000000  65.000000  76.000000    85.000000  82.000000  50.60000
75%    67.000000  75.000000  87.000000    92.000000  88.000000  56.80000
max    85.000000  83.000000  95.000000    99.000000  93.000000  66.60000

In [8]:
# Final Result 
print(df)

         English  History  Geography  Mathematics  Science  Average
Sam         60.0     65.0        0.0         99.0     89.0     62.6
Jackson     74.0      0.0       92.0         89.0      0.0     51.0
Ahree       85.0      0.0       76.0         85.0     87.0     66.6
Gloria       0.0     83.0       95.0         74.0      0.0     50.4
Isla         0.0     78.0       82.0          0.0     93.0     50.6
Aron         0.0     72.0       75.0          0.0     82.0     45.8
Gray         0.0     61.0        0.0         95.0     78.0     46.8

 # Write a Python program to create a series from 1 to 1000 and select only numbers divisible by 7 and 17.

In [9]:
# import pandas and numpy
import pandas as pd
import numpy as np

In [10]:
a=np.arange(1,1001)
ser = pd.Series(a)
print(ser)

0         1
1         2
2         3
3         4
4         5
       ...
995     996
996     997
997     998
998     999
999    1000
Length: 1000, dtype: int32

In [11]:
for num in ser:
    if(num%7==0 and num%17==0):
        print(num)

119
238
357
476
595
714
833
952